#!/usr/bin/ruby

#
# 標準入力から標準出力へ垂れ流す。
# -=-=-=-=-=-=-=-=-=-=-{
# この間の行を貯めておいて、最後にまとめて出力する。
# -=-=-=-=-=-=-=-=-=-=-}
# 

r = ''
f = false
num = 0
while gets
  gsub(%r(/cygdrive/(.)/), '\1:/')
  puts $_
  STDOUT.flush
  if /-=-=-=-=-=-=-=-=-=-=-\{\s*/ =~ $_
    f = true
    n = $'.chomp
    r += "-=-=-=-=-=- #{n} -=-=-=-=-=-\n"
  elsif /-=-=-=-=-=-=-=-=-=-=-\}/ =~ $_
    f = false
    num += 1
  elsif f
    r += $_
  end
end

puts '======================================================================'
puts '                            test summary'
puts '======================================================================'
puts r
puts '======================================================================'
puts "#{num} tests executed."
